; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l10_p10_c10_g10)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    loc8 - location
    loc9 - location
    loc10 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    person8 - person
    person9 - person
    person10 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    crate7 - crate
    crate8 - crate
    crate9 - crate
    crate10 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-crate crate7 depot)
    (at-crate crate8 depot)
    (at-crate crate9 depot)
    (at-crate crate10 depot)
    (at-person person1 loc2)
    (at-person person2 loc9)
    (at-person person3 loc10)
    (at-person person4 loc8)
    (at-person person5 loc1)
    (at-person person6 loc3)
    (at-person person7 loc4)
    (at-person person8 loc10)
    (at-person person9 loc9)
    (at-person person10 loc4)
    (crate-content crate1 food)
    (crate-content crate2 food)
    (crate-content crate3 food)
    (crate-content crate4 food)
    (crate-content crate5 food)
    (crate-content crate6 food)
    (crate-content crate7 food)
    (crate-content crate8 food)
    (crate-content crate9 medicine)
    (crate-content crate10 medicine)
  )
  (:goal (and
    (has-content person1 food)
    (has-content person2 food)
    (has-content person3 food)
    (has-content person4 food)
    (has-content person4 medicine)
    (has-content person5 food)
    (has-content person6 food)
    (has-content person6 medicine)
    (has-content person7 food)
    (has-content person10 food)
  ))
)

; plan
1. (pick-up drone1 right crate9 depot)
   deleted: (at-crate crate9 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate9)
   goals met: 0 of 10
2. (pick-up drone1 left crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate1)
   goals met: 0 of 10
3. (fly drone1 depot loc2)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc2)
   goals met: 0 of 10
4. (deliver drone1 left crate1 person1 loc2 food)
   deleted: (holding drone1 left crate1)
   added: (hand-empty drone1 left) (has-content person1 food)
   goals met: 1 of 10
5. (fly drone1 loc2 depot)
   deleted: (at-drone drone1 loc2)
   added: (at-drone drone1 depot)
   goals met: 1 of 10
6. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 1 of 10
7. (fly drone1 depot loc9)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc9)
   goals met: 1 of 10
8. (deliver drone1 left crate2 person2 loc9 food)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person2 food)
   goals met: 2 of 10
9. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 2 of 10
10. (pick-up drone1 left crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate3)
   goals met: 2 of 10
11. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 2 of 10
12. (deliver drone1 left crate3 person3 loc10 food)
   deleted: (holding drone1 left crate3)
   added: (hand-empty drone1 left) (has-content person3 food)
   goals met: 3 of 10
13. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 3 of 10
14. (pick-up drone1 left crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate4)
   goals met: 3 of 10
15. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 3 of 10
16. (fly drone1 loc8 loc1)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 loc1)
   goals met: 3 of 10
17. (deliver drone1 left crate4 person5 loc1 food)
   deleted: (holding drone1 left crate4)
   added: (hand-empty drone1 left) (has-content person5 food)
   goals met: 4 of 10
18. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 4 of 10
19. (pick-up drone1 left crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate5)
   goals met: 4 of 10
20. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 4 of 10
21. (deliver drone1 left crate5 person4 loc8 food)
   deleted: (holding drone1 left crate5)
   added: (hand-empty drone1 left) (has-content person4 food)
   goals met: 5 of 10
22. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 5 of 10
23. (pick-up drone1 left crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate6)
   goals met: 5 of 10
24. (fly drone1 depot loc8)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc8)
   goals met: 5 of 10
25. (deliver drone1 right crate9 person4 loc8 medicine)
   deleted: (holding drone1 right crate9)
   added: (hand-empty drone1 right) (has-content person4 medicine)
   goals met: 6 of 10
26. (fly drone1 loc8 depot)
   deleted: (at-drone drone1 loc8)
   added: (at-drone drone1 depot)
   goals met: 6 of 10
27. (pick-up drone1 right crate10 depot)
   deleted: (at-crate crate10 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate10)
   goals met: 6 of 10
28. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 6 of 10
29. (deliver drone1 right crate10 person6 loc3 medicine)
   deleted: (holding drone1 right crate10)
   added: (hand-empty drone1 right) (has-content person6 medicine)
   goals met: 7 of 10
30. (deliver drone1 left crate6 person6 loc3 food)
   deleted: (holding drone1 left crate6)
   added: (hand-empty drone1 left) (has-content person6 food)
   goals met: 8 of 10
31. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 8 of 10
32. (pick-up drone1 right crate7 depot)
   deleted: (at-crate crate7 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate7)
   goals met: 8 of 10
33. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 8 of 10
34. (deliver drone1 right crate7 person7 loc4 food)
   deleted: (holding drone1 right crate7)
   added: (hand-empty drone1 right) (has-content person7 food)
   goals met: 9 of 10
35. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 9 of 10
36. (pick-up drone1 right crate8 depot)
   deleted: (at-crate crate8 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate8)
   goals met: 9 of 10
37. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 9 of 10
38. (deliver drone1 right crate8 person10 loc4 food)
   deleted: (holding drone1 right crate8)
   added: (hand-empty drone1 right) (has-content person10 food)
   goals met: 10 of 10
